// Задача 64: Задайте значение N. 
//выведет все натуральные числа в промежутке от N до 1. 
//рекурсии.

// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

static void Foo(int n)
{
    if (n > 0)
    {
        Console.Write("{0} ", n);
        Foo(n - 1);
    }
}


Foo(10);